app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.build(post_params)
    if @post.save
---
INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at", "picture") VALUES (?, ?, ?, ?, ?)  [["content", "asdf"], ["user_id", 1], ["created_at", 2016-12-25 00:59:17 UTC], ["updated_at", 2016-12-25 00:59:17 UTC], ["picture", "Screen_Shot_2016-12-20_at_8.52.56_PM.png"]]